Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT500/periph/PERI_INPUTMUX.h
/*
** ###################################################################
**     Processors:          MIMXRT533SFAWC
**                          MIMXRT533SFFOC
**                          MIMXRT555SFAWC
**                          MIMXRT555SFFOC
**                          MIMXRT595SFAWC_cm33
**                          MIMXRT595SFAWC_dsp
**                          MIMXRT595SFFOC_cm33
**                          MIMXRT595SFFOC_dsp
**
**     Version:             rev. 6.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for INPUTMUX
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2019-04-19)
**         Initial version.
**     - rev. 2.0 (2019-07-22)
**         Base on rev 0.7 RM.
**     - rev. 3.0 (2020-03-16)
**         Base on Rev.A RM.
**     - rev. 4.0 (2020-05-18)
**         Base on Rev.B RM.
**     - rev. 5.0 (2020-08-27)
**         Base on Rev.C RM.
**     - rev. 6.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_INPUTMUX.h
 * @version 6.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for INPUTMUX
 *
 * CMSIS Peripheral Access Layer for INPUTMUX
 */

#if !defined(PERI_INPUTMUX_H_)
#define PERI_INPUTMUX_H_                         /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT533SFAWC) || defined(CPU_MIMXRT533SFFOC))
#include "../MIMXRT533S_COMMON.h"
#elif (defined(CPU_MIMXRT555SFAWC) || defined(CPU_MIMXRT555SFFOC))
#include "../MIMXRT555S_COMMON.h"
#elif (defined(CPU_MIMXRT595SFAWC_cm33) || defined(CPU_MIMXRT595SFFOC_cm33))
#include "../MIMXRT595S_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT595SFAWC_dsp) || defined(CPU_MIMXRT595SFFOC_dsp))
#include "../MIMXRT595S_dsp_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__XTENSA__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- INPUTMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INPUTMUX_Peripheral_Access_Layer INPUTMUX Peripheral Access Layer
 * @{
 */

/** INPUTMUX - Size of Registers Arrays */
#define INPUTMUX_SCT0_IN_SEL_COUNT                7u
#define INPUTMUX_PINT_SEL_COUNT                   8u
#define INPUTMUX_DSP_INT_SEL_COUNT                27u
#define INPUTMUX_DMAC0_ITRIG_SEL_COUNT            37u
#define INPUTMUX_DMAC0_OTRIG_SEL_COUNT            4u
#define INPUTMUX_DMAC0_CHMUX_SEL_COUNT            16u
#define INPUTMUX_DMAC1_ITRIG_SEL_COUNT            37u
#define INPUTMUX_DMAC1_OTRIG_SEL_COUNT            4u
#define INPUTMUX_DMAC1_CHMUX_SEL_COUNT            16u
#define INPUTMUX_CT32BIT_CAP_SEL_COUNT            5u
#define INPUTMUX_CT32BIT_CAP_SEL_CT32BITY_CAPX_SEL_COUNT 4u
#define INPUTMUX_FMEASURE_CH_SEL_COUNT            2u
#define INPUTMUX_SMART_DMA_TRIG_CHN_SEL_COUNT     8u

/** INPUTMUX - Register Layout Typedef */
typedef struct {
  __IO uint32_t SCT0_IN_SEL[INPUTMUX_SCT0_IN_SEL_COUNT]; /**< SCT Peripheral Input multiplexer 0..SCT Peripheral Input multiplexer 6, array offset: 0x0, array step: 0x4 */
       uint8_t RESERVED_0[228];
  __IO uint32_t PINT_SEL[INPUTMUX_PINT_SEL_COUNT]; /**< GPIO Pin Input Multiplexer 0..GPIO Pin Input Multiplexer 7, array offset: 0x100, array step: 0x4 */
       uint8_t RESERVED_1[32];
  __IO uint32_t DSP_INT_SEL[INPUTMUX_DSP_INT_SEL_COUNT]; /**< Fusion DSP Interrupt Input Multiplexer, array offset: 0x140, array step: 0x4 */
       uint8_t RESERVED_2[84];
  __IO uint32_t DMAC0_ITRIG_SEL[INPUTMUX_DMAC0_ITRIG_SEL_COUNT]; /**< DMAC0 Input Trigger Select, array offset: 0x200, array step: 0x4 */
       uint8_t RESERVED_3[108];
  __IO uint32_t DMAC0_OTRIG_SEL[INPUTMUX_DMAC0_OTRIG_SEL_COUNT]; /**< DMAC0 Output Trigger Select, array offset: 0x300, array step: 0x4 */
       uint8_t RESERVED_4[16];
  __IO uint32_t DMAC0_CHMUX_SEL[INPUTMUX_DMAC0_CHMUX_SEL_COUNT]; /**< DMAC0 Channel mux select 0..DMAC0 Channel mux select 15, array offset: 0x320, array step: 0x4 */
       uint8_t RESERVED_5[160];
  __IO uint32_t DMAC1_ITRIG_SEL[INPUTMUX_DMAC1_ITRIG_SEL_COUNT]; /**< DMAC1 Input Trigger Select, array offset: 0x400, array step: 0x4 */
       uint8_t RESERVED_6[108];
  __IO uint32_t DMAC1_OTRIG_SEL[INPUTMUX_DMAC1_OTRIG_SEL_COUNT]; /**< DMAC1 Output Trigger Select, array offset: 0x500, array step: 0x4 */
       uint8_t RESERVED_7[16];
  __IO uint32_t DMAC1_CHMUX_SEL[INPUTMUX_DMAC1_CHMUX_SEL_COUNT]; /**< DMAC1 Channel mux select 0..DMAC1 Channel mux select 15, array offset: 0x520, array step: 0x4 */
       uint8_t RESERVED_8[160];
  __IO uint32_t CT32BIT_CAP_SEL[INPUTMUX_CT32BIT_CAP_SEL_COUNT][INPUTMUX_CT32BIT_CAP_SEL_CT32BITY_CAPX_SEL_COUNT]; /**< CT32BIT Timer Capture Multiplexers, array offset: 0x600, array step: index*0x10, index2*0x4 */
       uint8_t RESERVED_9[176];
  __IO uint32_t FMEASURE_CH_SEL[INPUTMUX_FMEASURE_CH_SEL_COUNT]; /**< Frequency Measurement Input Channel Multiplexers, array offset: 0x700, array step: 0x4 */
       uint8_t RESERVED_10[24];
  __IO uint32_t SMART_DMA_TRIG_CH_SEL[INPUTMUX_SMART_DMA_TRIG_CHN_SEL_COUNT]; /**< SMART_DMA trigger channel select, array offset: 0x720, array step: 0x4 */
  __IO uint32_t DMAC0_REQ_ENA0;                    /**< DMAC0 request enable 0, offset: 0x740 */
  __IO uint32_t DMAC0_REQ_ENA1;                    /**< DMAC0 request enable 1, offset: 0x744 */
  __IO uint32_t DMAC0_REQ_ENA0_SET;                /**< DMAC0 request enable set 0, offset: 0x748 */
  __IO uint32_t DMAC0_REQ_ENA1_SET;                /**< DMAC0 request enable set 1, offset: 0x74C */
  __IO uint32_t DMAC0_REQ_ENA0_CLR;                /**< DMAC0 request enable clear 0, offset: 0x750 */
  __IO uint32_t DMAC0_REQ_ENA1_CLR;                /**< DMAC0 request enable 1 clear, offset: 0x754 */
       uint8_t RESERVED_11[8];
  __IO uint32_t DMAC1_REQ_ENA0;                    /**< DMAC1 request enable 0, offset: 0x760 */
  __IO uint32_t DMAC1_REQ_ENA1;                    /**< DMAC1 request enable 1, offset: 0x764 */
  __IO uint32_t DMAC1_REQ_ENA0_SET;                /**< DMAC1 request enable set 0, offset: 0x768 */
  __IO uint32_t DMAC1_REQ_ENA1_SET;                /**< DMAC1 request enable set 1, offset: 0x76C */
  __IO uint32_t DMAC1_REQ_ENA0_CLR;                /**< DMAC1 request enable clear 0, offset: 0x770 */
  __IO uint32_t DMAC1_REQ_ENA1_CLR;                /**< DMAC1 request enable 1 clear, offset: 0x774 */
       uint8_t RESERVED_12[8];
  __IO uint32_t DMAC0_ITRIG_ENA0;                  /**< DMAC0 Input Trigger Enable 0, offset: 0x780 */
       uint8_t RESERVED_13[4];
  __O  uint32_t DMAC0_ITRIG_ENA0_SET;              /**< DMAC0 Input Trigger Enable 0 Set, offset: 0x788 */
       uint8_t RESERVED_14[4];
  __O  uint32_t DMAC0_ITRIG_ENA0_CLR;              /**< DMAC0 Input Trigger Enable 0 Clear, offset: 0x790 */
       uint8_t RESERVED_15[12];
  __IO uint32_t DMAC1_ITRIG_ENA0;                  /**< DMAC1 Input Trigger Enable 0, offset: 0x7A0 */
       uint8_t RESERVED_16[4];
  __O  uint32_t DMAC1_ITRIG_ENA0_SET;              /**< DMAC1 Input Trigger Enable 0 set, offset: 0x7A8 */
       uint8_t RESERVED_17[4];
  __O  uint32_t DMAC1_ITRIG_ENA0_CLR;              /**< DMAC1 Input Trigger Enable 0 clear, offset: 0x7B0 */
} INPUTMUX_Type;

/* ----------------------------------------------------------------------------
   -- INPUTMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INPUTMUX_Register_Masks INPUTMUX Register Masks
 * @{
 */

/*! @name SCT0_IN_SEL - SCT Peripheral Input multiplexer 0..SCT Peripheral Input multiplexer 6 */
/*! @{ */

#define INPUTMUX_SCT0_IN_SEL_SCT_IN_SEL_MASK     (0x1FU)
#define INPUTMUX_SCT0_IN_SEL_SCT_IN_SEL_SHIFT    (0U)
/*! SCT_IN_SEL - SCT0 Input Selection.
 *  0b00000..SCT0_PIN_INP0
 *  0b00001..SCT0_PIN_INP1
 *  0b00010..SCT0_PIN_INP2
 *  0b00011..SCT0_PIN_INP3
 *  0b00100..SCT0_PIN_INP4
 *  0b00101..SCT0_PIN_INP5
 *  0b00110..SCT0_PIN_INP6
 *  0b00111..SCT0_PIN_INP7
 *  0b01000..CT32BIT0_MAT0
 *  0b01001..CT32BIT1_MAT0
 *  0b01010..CT32BIT2_MAT0
 *  0b01011..CT32BIT3_MAT0
 *  0b01100..CT32BIT4_MAT0
 *  0b01101..ADCIRQ
 *  0b01110..GPIOINT_BMATCH
 *  0b01111..USB0_FRAME_TOGGLE
 *  0b10000..CMP0_OUT
 *  0b10001..SHARED I2S0_SCLK
 *  0b10010..SHARED I2S1_SCLK
 *  0b10011..SHARED I2S0_WS
 *  0b10100..SHARED I2S1_WS
 *  0b10101..MCLK
 *  0b10110..ARM_TXEV
 *  0b10111..DEBUG_HALTED
 *  0b11000..Reserved
 *  0b11001..Reserved
 *  0b11010..Reserved
 *  0b11011..Reserved
 *  0b11100..Reserved
 *  0b11101..Reserved
 *  0b11110..Reserved
 *  0b11111..Reserved
 */
#define INPUTMUX_SCT0_IN_SEL_SCT_IN_SEL(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_SCT0_IN_SEL_SCT_IN_SEL_SHIFT)) & INPUTMUX_SCT0_IN_SEL_SCT_IN_SEL_MASK)
/*! @} */

/*! @name PINT_SEL - GPIO Pin Input Multiplexer 0..GPIO Pin Input Multiplexer 7 */
/*! @{ */

#define INPUTMUX_PINT_SEL_PINT_SEL_MASK          (0xFFU)
#define INPUTMUX_PINT_SEL_PINT_SEL_SHIFT         (0U)
/*! PINT_SEL - Interrupt select */
#define INPUTMUX_PINT_SEL_PINT_SEL(x)            (((uint32_t)(((uint32_t)(x)) << INPUTMUX_PINT_SEL_PINT_SEL_SHIFT)) & INPUTMUX_PINT_SEL_PINT_SEL_MASK)
/*! @} */

/*! @name DSP_INT_SEL - Fusion DSP Interrupt Input Multiplexer */
/*! @{ */

#define INPUTMUX_DSP_INT_SEL_DSP_INT_SEL_MASK    (0x3FU)
#define INPUTMUX_DSP_INT_SEL_DSP_INT_SEL_SHIFT   (0U)
/*! DSP_INT_SEL
 *  0b000000..FLEXCOMM0_IRQ
 *  0b000001..FLEXCOMM1_IRQ
 *  0b000010..FLEXCOMM2_IRQ
 *  0b000011..FLEXCOMM3_IRQ
 *  0b000100..FLEXCOMM4_IRQ
 *  0b000101..FLEXCOMM5_IRQ
 *  0b000110..FLEXCOMM6_IRQ
 *  0b000111..FLEXCOMM7_IRQ
 *  0b001000..FLEXCOMM14_IRQ
 *  0b001001..FLEXCOMM16_IRQ
 *  0b001010..GPIO_INT0_IRQ0
 *  0b001011..GPIO_INT0_IRQ1
 *  0b001100..GPIO_INT0_IRQ2
 *  0b001101..GPIO_INT0_IRQ3
 *  0b001110..GPIO_INT0_IRQ4
 *  0b001111..GPIO_INT0_IRQ5
 *  0b010000..GPIO_INT0_IRQ6
 *  0b010001..GPIO_INT0_IRQ7
 *  0b010010..NSHSGPIO_INT0_IRQ0
 *  0b010011..NSHSGPIO_INT1_IRQ1
 *  0b010100..WDT1
 *  0b010101..DMAC0_IRQ
 *  0b010110..DMAC1_IRQ
 *  0b010111..MU_B_IRQ
 *  0b011000..UTICK0_IRQ
 *  0b011001..MRT0_IRQ
 *  0b011010..OS_EVENT_TIMER or OS_EVENT_WAKEUP
 *  0b011011..CTIMER0
 *  0b011100..CTIMER1
 *  0b011101..CTIMER2
 *  0b011110..CTIMER3
 *  0b011111..CTIMER4
 *  0b100000..RTC_LITE0_ALARM or RTC_LITE0_WAKEUP
 *  0b100001..I3C0
 *  0b100010..I3C1
 *  0b100011..DMIC0
 *  0b100100..HWVAD
 *  0b100101..LCDIF_IRQ
 *  0b100110..GPU_IRQ
 *  0b100111..SMARTDMA_IRQ
 *  0b101000..FLEXIO_IRQ
 */
#define INPUTMUX_DSP_INT_SEL_DSP_INT_SEL(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DSP_INT_SEL_DSP_INT_SEL_SHIFT)) & INPUTMUX_DSP_INT_SEL_DSP_INT_SEL_MASK)
/*! @} */

/*! @name DMAC0_ITRIG_SEL - DMAC0 Input Trigger Select */
/*! @{ */

#define INPUTMUX_DMAC0_ITRIG_SEL_DMAC0_ITRIG_SEL_MASK (0x1FU)
#define INPUTMUX_DMAC0_ITRIG_SEL_DMAC0_ITRIG_SEL_SHIFT (0U)
/*! DMAC0_ITRIG_SEL - DMA Input Trigger Selection.
 *  0b00000..GPIO_INT0
 *  0b00001..GPIO_INT1
 *  0b00010..GPIO_INT2
 *  0b00011..GPIO_INT3
 *  0b00100..T0_DMAREQ_M0
 *  0b00101..T0_DMAREQ_M1
 *  0b00110..T1_DMAREQ_M0
 *  0b00111..T1_DMAREQ_M1
 *  0b01000..T2_DMAREQ_M0
 *  0b01001..T2_DMAREQ_M1
 *  0b01010..T3_DMAREQ_M0
 *  0b01011..T3_DMAREQ_M1
 *  0b01100..T4_DMAREQ_M0
 *  0b01101..T4_DMAREQ_M1
 *  0b01110..DMA0_TRIGOUT_A
 *  0b01111..DMA0_TRIGOUT_B
 *  0b10000..DMA0_TRIGOUT_C
 *  0b10001..DMA0_TRIGOUT_D
 *  0b10010..SCT_DMAC0_REQ0
 *  0b10011..SCT_DMAC1_REQ1
 *  0b10100..HASHCRYPT_OUT_DMA
 *  0b10101..ACMP_DMA
 *  0b10110..FlexSPI0_RX_DMA
 *  0b10111..FlexSPI0_TX_DMA
 *  0b11000..ADC_DMA
 *  0b11001..FlexSPI1_RX_DMA
 *  0b11010..FlexSPI1_TX_DMA
 *  0b11011..Reserved
 *  0b11100..Reserved
 *  0b11101..Reserved
 *  0b11111..Reserved
 */
#define INPUTMUX_DMAC0_ITRIG_SEL_DMAC0_ITRIG_SEL(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMAC0_ITRIG_SEL_DMAC0_ITRIG_SEL_SHIFT)) & INPUTMUX_DMAC0_ITRIG_SEL_DMAC0_ITRIG_SEL_MASK)
/*! @} */

/*! @name DMAC0_OTRIG_SEL - DMAC0 Output Trigger Select */
/*! @{ */

#define INPUTMUX_DMAC0_OTRIG_SEL_DMAC0_OTRIG_SEL_MASK (0x3FU)
#define INPUTMUX_DMAC0_OTRIG_SEL_DMAC0_OTRIG_SEL_SHIFT (0U)
/*! DMAC0_OTRIG_SEL
 *  0b000000..DMAC0_OTRIG_CH0
 *  0b000001..DMAC0_OTRIG_CH1
 *  0b000010..DMAC0_OTRIG_CH2
 *  0b000011..DMAC0_OTRIG_CH3
 *  0b000100..DMAC0_OTRIG_CH4
 *  0b000101..DMAC0_OTRIG_CH5
 *  0b000110..DMAC0_OTRIG_CH6
 *  0b000111..DMAC0_OTRIG_CH7
 *  0b001000..DMAC0_OTRIG_CH8
 *  0b001001..DMAC0_OTRIG_CH9
 *  0b001010..DMAC0_OTRIG_CH10
 *  0b001011..DMAC0_OTRIG_CH11
 *  0b001100..DMAC0_OTRIG_CH12
 *  0b001101..DMAC0_OTRIG_CH13
 *  0b001110..DMAC0_OTRIG_CH14
 *  0b001111..DMAC0_OTRIG_CH15
 *  0b010000..DMAC0_OTRIG_CH16
 *  0b010001..DMAC0_OTRIG_CH17
 *  0b010010..DMAC0_OTRIG_CH18
 *  0b010011..DMAC0_OTRIG_CH19
 *  0b010100..DMAC0_OTRIG_CH20
 *  0b010101..DMAC0_OTRIG_CH21
 *  0b010110..DMAC0_OTRIG_CH22
 *  0b010111..DMAC0_OTRIG_CH23
 *  0b011000..DMAC0_OTRIG_CH24
 *  0b011001..DMAC0_OTRIG_CH25
 *  0b011010..DMAC0_OTRIG_CH26
 *  0b011011..DMAC0_OTRIG_CH27
 *  0b011100..DMAC0_OTRIG_CH28
 *  0b011101..DMAC0_OTRIG_CH29
 *  0b011110..DMAC0_OTRIG_CH30
 *  0b011111..DMAC0_OTRIG_CH31
 *  0b100000..DMAC0_OTRIG_CH32
 *  0b100001..DMAC0_OTRIG_CH33
 *  0b100010..DMAC0_OTRIG_CH34
 *  0b100011..DMAC0_OTRIG_CH35
 *  0b100100..DMAC0_OTRIG_CH36
 */
#define INPUTMUX_DMAC0_OTRIG_SEL_DMAC0_OTRIG_SEL(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMAC0_OTRIG_SEL_DMAC0_OTRIG_SEL_SHIFT)) & INPUTMUX_DMAC0_OTRIG_SEL_DMAC0_OTRIG_SEL_MASK)
/*! @} */

/*! @name DMAC0_CHMUX_SEL - DMAC0 Channel mux select 0..DMAC0 Channel mux select 15 */
/*! @{ */

#define INPUTMUX_DMAC0_CHMUX_SEL_DMAC0_CHMUX_SEL_MASK (0x1U)
#define INPUTMUX_DMAC0_CHMUX_SEL_DMAC0_CHMUX_SEL_SHIFT (0U)
/*! DMAC0_CHMUX_SEL - DMAC0 Channel mux select 1
 *  0b0..DMIC_CH4_DMA
 *  0b1..FLEXCOM10_RX_DMA
 */
#define INPUTMUX_DMAC0_CHMUX_SEL_DMAC0_CHMUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMAC0_CHMUX_SEL_DMAC0_CHMUX_SEL_SHIFT)) & INPUTMUX_DMAC0_CHMUX_SEL_DMAC0_CHMUX_SEL_MASK)
/*! @} */

/*! @name DMAC1_ITRIG_SEL - DMAC1 Input Trigger Select */
/*! @{ */

#define INPUTMUX_DMAC1_ITRIG_SEL_DMAC1_ITRIG_SEL_MASK (0x1FU)
#define INPUTMUX_DMAC1_ITRIG_SEL_DMAC1_ITRIG_SEL_SHIFT (0U)
/*! DMAC1_ITRIG_SEL - DMA Input Trigger Selection.
 *  0b00000..GPIO_INT0
 *  0b00001..GPIO_INT1
 *  0b00010..GPIO_INT2
 *  0b00011..GPIO_INT3
 *  0b00100..T0_DMAREQ_M0
 *  0b00101..T0_DMAREQ_M1
 *  0b00110..T1_DMAREQ_M0
 *  0b00111..T1_DMAREQ_M1
 *  0b01000..T2_DMAREQ_M0
 *  0b01001..T2_DMAREQ_M1
 *  0b01010..T3_DMAREQ_M0
 *  0b01011..T3_DMAREQ_M1
 *  0b01100..T4_DMAREQ_M0
 *  0b01101..T4_DMAREQ_M1
 *  0b01110..DMA0_TRIGOUT_A
 *  0b01111..DMA0_TRIGOUT_B
 *  0b10000..DMA0_TRIGOUT_C
 *  0b10001..DMA0_TRIGOUT_D
 *  0b10010..SCT_DMAC0_REQ0
 *  0b10011..SCT_DMAC1_REQ1
 *  0b10100..HASHCRYPT_OUT_DMA
 *  0b10101..ACMP_DMA
 *  0b10110..FlexSPI0_RX_DMA
 *  0b10111..FlexSPI0_TX_DMA
 *  0b11000..ADC_DMA
 *  0b11001..FlexSPI1_RX_DMA
 *  0b11010..FlexSPI1_TX_DMA
 *  0b11011..Reserved
 *  0b11100..Reserved
 *  0b11101..Reserved
 *  0b11111..Reserved
 */
#define INPUTMUX_DMAC1_ITRIG_SEL_DMAC1_ITRIG_SEL(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMAC1_ITRIG_SEL_DMAC1_ITRIG_SEL_SHIFT)) & INPUTMUX_DMAC1_ITRIG_SEL_DMAC1_ITRIG_SEL_MASK)
/*! @} */

